<a href="https://colab.research.google.com/github/polarpubhanu/nlp_1/blob/main/nlp4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np
import re

In [ ]:
pattern = r'\w+@\w+.\w+'
pattern = r'\b\b'

In [ ]:
data_out = pd.read_csv('/twitter4000.csv')

In [ ]:
data_out['email'] = data_out['twitts'].apply(lambda x: re.findall(pattern=pattern, string=x))
data_out['email'].sample(5)

850                                             [, , , ]
557                     [, , , , , , , , , , , , , , , ]
233     [, , , , , , , , , , , , , , , , , , , , , , , ]
3421        [, , , , , , , , , , , , , , , , , , , , , ]
3518                                [, , , , , , , , , ]
Name: email, dtype: object

In [ ]:
data_out['twitts'].apply(lambda x: re.findall(pattern=pattern, string=x))

0                [, , , , , , , , , , , , , , , , , , , ]
1                            [, , , , , , , , , , , , , ]
2       [, , , , , , , , , , , , , , , , , , , , , , ,...
3                                [, , , , , , , , , , , ]
4       [, , , , , , , , , , , , , , , , , , , , , , ,...
                              ...
3995                                         [, , , , , ]
3996                     [, , , , , , , , , , , , , , , ]
3997                                 [, , , , , , , , , ]
3998             [, , , , , , , , , , , , , , , , , , , ]
3999    [, , , , , , , , , , , , , , , , , , , , , , ,...
Name: twitts, Length: 4000, dtype: object

In [ ]:
import pandas as pd
import re

data_out = pd.DataFrame({
    'twitts': ['hello123world', 'python3 is great', 'data2024science']
})

data_out['twitts_clean'] = data_out['twitts'].apply(
    lambda x: re.sub(r'\d+', '', x)
)

print(data_out)

             twitts     twitts_clean
0     hello123world       helloworld
1  python3 is great  python is great
2   data2024science      datascience

In [ ]:
import re

data_out['twitts'] = data_out['twitts'].apply(
    lambda x: re.sub(r'http\S+|www\S+', '', x)
)

In [ ]:
# remove special characters & punctuation
data_out['twitts'] = data_out['twitts'].apply(
    lambda x: re.sub(r'[^A-Za-z\s]', '', x)
)

# convert to lowercase
data_out['twitts'] = data_out['twitts'].str.lower()

# remove extra spaces
data_out['twitts'] = data_out['twitts'].str.strip()

In [ ]:
import nltk
nltk.download('stopwords')

from nltk.corpus import stopwords

stop_words = set(stopwords.words('english'))

data_out['twitts'] = data_out['twitts'].apply(
    lambda x: ' '.join(word for word in x.split() if word not in stop_words)
)

[nltk_data] Downloading package stopwords to /root/nltk_data...
[nltk_data]   Unzipping corpora/stopwords.zip.

In [ ]:
stop_words = set(stopwords.words('english'))
data_out['twitts'] = data_out['twitts'].apply(
    lambda x: ' '.join(word for word in x.split() if word not in stop_words)
)

In [ ]:
data_out['twitts'] = data_out['twitts'].apply(
    lambda x: re.sub(r'[^A-Za-z\s]', '', x)
)

In [ ]:
data_out['twitts'] = data_out['twitts'].apply(
    lambda x: re.sub(r'\S+@\S+', '', x)
)

In [ ]:
data_out['twitts'] = data_out['twitts'].apply(
    lambda x: re.sub(r'<.*?>', '', x)
)

In [ ]:
data_out['twitts'] = data_out['twitts'].str.lower()

In [ ]:
data_out['twitts'] = data_out['twitts'].str.strip()

In [ ]:
stop_words = set(stopwords.words('english'))
data_out['twitts'] = data_out['twitts'].apply(
    lambda x: ' '.join(word for word in x.split() if word not in stop_words)
)

In [ ]:
print(data_out)

         twitts     twitts_clean
0    helloworld       helloworld
1  python great  python is great
2   datascience      datascience